Revit 2017 API
EndTreatmentType.Create Method (Document, String)
 Creates a new EndTreatmentType in a document and adds the input string to the endTreatment parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public static EndTreatmentType Create(
	Document doc,
	string strTreatment
)
Visual Basic
Public Shared Function Create ( _
	doc As Document, _
	strTreatment As String _
) As EndTreatmentType
Visual C++
public:
static EndTreatmentType^ Create(
	Document^ doc,
	String^ strTreatment
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
strTreatment
Type: System.String
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
EndTreatmentType Class
Create Overload
Autodesk.Revit.DB.Structure Namespace